"""
寝室楼索引存储表
- 获取寝室楼的索引get_buildingIndex

这里要自己做一个脚本去遍历扫一遍

Build by ArisuMika
"""
Building = [
    #西区
    {
        "1东":0,
        "1西":1,
        "2东":5,
        "2西":6,
        "3北":8,
        "3南":9,
        "4东":12,
        "4西":13,
        "5北":15,
        "5南":16,
        "6东":19,
        "6西":20,
        "7北":22,
        "7南":23,
        "8东":26,
        "8西":27,
        "9北":29,
        "9南":30,
        "10北":33,
        "10南":34,
        "11北":36,
        "11南":37,
        "13":39
    },
    #东区
    {
        "D1":1,
        "D2":2,
        "D3":3,
        "D4东":6,
        "D4西":7,
        "D5":8,
        "D6":9,
        "D7东":11,
        "D7西":12,
        "D8":13,
        "D9东":14,
        "D9西":15
    }
]

def get_buildingIndex(area,buildingNum):

    return Building[area][buildingNum]
